---
kind: other
id: Properties.T:Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzer
source: html/599162cc-eb67-fb3a-0862-c4b8128f6525.htm
---
# BuildingEnvelopeAnalyzer Properties

Specifies whether the .NET object represents a valid Revit entity.